; domain
(define (domain shakey)

    (:requirements 
        :strips
    )

    (:types
        Room
        Door
        Object  
        Switch
        Robot
        Gripper
    )

    (:predicates
        
        ; Define a switch
        (isSwitch 
            ?switch - Switch)
        
        ; Define a gripper
        (isGripper 
            ?gripper - Gripper)

        ; Which door is between which two rooms?
        (isConnectionBetween 
            ?door - Door
            ?room-1 ?room-2 - Room)
        
        ; Which door is wide?
        (isWide 
            ?door - Door)
        
        ; What object is pushable?
        (isPushable 
            ?item - Object)
        
        ; What object is climbable?
        (isClimbable 
            ?item - Object)
        
        ; What object is carriable?
        (isCarriable 
            ?item - Object)
        
        ; What object is movable?
        (isMovable 
            ?object - Object)
                
        ; Which object is which gripper carrying?
        (isCarrying 
            ?item - Object 
            ?gripper - Gripper)

        ; Which gripper is free?
        (isFree 
            ?gripper - Gripper)
        
        ; Which object is inside which room?
        (isInside 
            ?what - Object 
            ?room - Room)
        
        ; Is a switch turned on?    
        (isTurnedOn 
            ?switch - Switch)
        
        ; Is the robot climbing on top of an object?
        (isClimbingOnTopOfAnObject
            ?robot - Robot)
    )

    ; Robot moves from one room to another room through a door
    (:action travel 
        
        :parameters 
            (?robot ?thisRoom ?anotherRoom ?door)
        
        :precondition 
            (and 
                (isConnectionBetween ?door ?thisRoom ?anotherRoom)
                (isInside ?robot ?thisRoom)
                (isMovable ?robot)
                (not (isClimbingOnTopOfAnObject ?robot))
            ) 
        
        :effect 
            (and 
                (isInside ?robot ?anotherRoom)
                (not (isInside ?robot ?thisRoom))
            ) 

    )

    ; Robot can push a movable object to another room
    (:action push

        :parameters 
            (?robot ?item ?thisRoom ?anotherRoom ?door)
    
        :precondition 
            (and
                (isConnectionBetween ?door ?thisRoom ?anotherRoom)
                (isInside ?robot ?thisRoom)
                (isMovable ?robot)
                (isInside ?item ?thisRoom)
                (isPushable ?item)
                (isWide ?door)
                (not (isClimbingOnTopOfAnObject ?robot))
            ) 
    
        :effect 
            (and 
                (isInside ?robot ?anotherRoom)
                (isInside ?item ?anotherRoom)
                (not (isInside ?robot ?thisRoom))
                (not (isInside ?item ?thisRoom))
            )
    
    )

    ; Robot can ascend a box
    (:action ascend
    
        :parameters 
            (?robot ?box ?room)
    
        :precondition 
            (and 
                (isInside ?robot ?room)
                (isInside ?box ?room)
                (isMovable ?robot)
                (isClimbable ?box)
                (not (isClimbingOnTopOfAnObject ?robot)) 
            )
    
        :effect
            (isClimbingOnTopOfAnObject ?robot)
    
    )

    ; Robot can descend a box
    (:action descend
    
        :parameters 
            (?robot)
    
        :precondition 
            (and
                (isClimbingOnTopOfAnObject ?robot)
                (isMovable ?robot)
            )
    
        :effect
            (not (isClimbingOnTopOfAnObject ?robot))
    
    )

    ; Robot can turn on a switch in the room while on top of a box
    (:action on
    
        :parameters
            (?robot ?switch ?room)
    
        :precondition
            (and
                (isClimbingOnTopOfAnObject ?robot)
                (isInside ?robot ?room)
                (isInside ?switch ?room)
                (isSwitch ?switch)
                (not (isTurnedOn ?switch))
            )
    
        :effect
            (isTurnedOn ?switch)
    
    )

    ; Robot can carry object
    (:action carry
    
        :parameters
            (?robot ?item ?room ?switch ?gripper)
    
        :precondition
            (and
                (isInside ?robot ?room)
                (isInside ?switch ?room)
                (isInside ?item ?room)
                (isTurnedOn ?switch)
                (isCarriable ?item)
                (isMovable ?robot)
                (isGripper ?gripper)
                (isFree ?gripper)
                (not (isClimbingOnTopOfAnObject ?robot)) 
            )
    
        :effect
            (and
                (isCarrying ?item ?gripper)
                (not (isInside ?item ?room))
                (not (isFree ?gripper))
            )
    
    )

    ; Robot can release a carried item
    (:action release
    
        :parameters
            (?robot ?item ?room ?gripper)
    
        :precondition
            (and
                (isGripper ?gripper)
                (isCarrying ?item ?gripper)
                (isMovable ?robot)
                (isInside ?robot ?room)
                (not (isClimbingOnTopOfAnObject ?robot))
            )
    
        :effect
            (and
                (isFree ?gripper)
                (isInside ?item ?room)
                (not (isCarrying ?item ?gripper))
            )
    
    )

)

; problem
(define (problem problem_0)
  
    (:domain 
        shakey
    )

    (:objects

        cargo-room store-room inspection-room holding-room - Room
        door-1 door-2 door-3 door-4 - Door
        switch-1 switch-2 switch-3 - Switch

        shakey - Robot
        gripper-1 gripper-2 - Gripper 

        ball-1 ball-2 - Object ; can be carried
        box-1 box-2 box-3 - Object ; can be pushed and climbed

    )

    (:init
        
        (isSwitch switch-1)
        (isSwitch switch-2)
        (isSwitch switch-3)
        (isSwitch switch-4)
        (isInside switch-1 cargo-room) 
        (isInside switch-2 store-room) 
        (isInside switch-3 inspection-room) 

        (isGripper gripper-1) 
        (isGripper gripper-2)
        (isFree gripper-1)
        (isFree gripper-2)

        (isConnectionBetween door-1 cargo-room store-room) 
        (isConnectionBetween door-1 store-room cargo-room)
        (isConnectionBetween door-2 store-room inspection-room) 
        (isConnectionBetween door-2 inspection-room store-room)
        (isConnectionBetween door-3 cargo-room inspection-room) 
        (isConnectionBetween door-3 inspection-room cargo-room)
        (isConnectionBetween door-4 inspection-room holding-room)
        (isConnectionBetween door-4 holding-room inspection-room)
        
        (isWide door-1) 
        (isWide door-3)
        (isWide door-4)

        (isInside shakey cargo-room)
        (isMovable shakey)

        (isInside ball-1 cargo-room)
        (isCarriable ball-1)
        (isInside ball-2 cargo-room)
        (isCarriable ball-2)

        (isInside box-1 cargo-room)
        (isPushable box-1)
        (isClimbable box-1)
        (isInside box-2 cargo-room)
        (isPushable box-2)
        (isClimbable box-2)
        (isInside box-3 cargo-room)
        (isPushable box-3)
        (isClimbable box-3)

    )

    (:goal 
        (and
            (isInside shakey cargo-room)
            (isInside ball-1 holding-room)
            (isInside ball-2 store-room)
            (isInside box-1 inspection-room)
            (isInside box-2 holding-room)
        )
    )

)

; plan
1. (ascend shakey box-3 cargo-room)
   added: (isclimbingontopofanobject shakey)
   goals met: 1 of 5
2. (on shakey switch-1 cargo-room)
   added: (isturnedon switch-1)
   goals met: 1 of 5
3. (descend shakey)
   deleted: (isclimbingontopofanobject shakey)
   goals met: 1 of 5
4. (carry shakey ball-2 cargo-room switch-1 gripper-1)
   deleted: (isinside ball-2 cargo-room) (isfree gripper-1)
   added: (iscarrying ball-2 gripper-1)
   goals met: 1 of 5
5. (push shakey box-1 cargo-room inspection-room door-3)
   deleted: (isinside shakey cargo-room) (isinside box-1 cargo-room)
   added: (isinside shakey inspection-room) (isinside box-1 inspection-room)
   goals met: 1 of 5
6. (travel shakey inspection-room store-room door-2)
   deleted: (isinside shakey inspection-room)
   added: (isinside shakey store-room)
   goals met: 1 of 5
7. (release shakey ball-2 store-room gripper-1)
   deleted: (iscarrying ball-2 gripper-1)
   added: (isfree gripper-1) (isinside ball-2 store-room)
   goals met: 2 of 5
8. (travel shakey store-room cargo-room door-1)
   deleted: (isinside shakey store-room)
   added: (isinside shakey cargo-room)
   goals met: 3 of 5
9. (carry shakey ball-1 cargo-room switch-1 gripper-1)
   deleted: (isinside ball-1 cargo-room) (isfree gripper-1)
   added: (iscarrying ball-1 gripper-1)
   goals met: 3 of 5
10. (push shakey box-2 cargo-room inspection-room door-3)
   deleted: (isinside shakey cargo-room) (isinside box-2 cargo-room)
   added: (isinside shakey inspection-room) (isinside box-2 inspection-room)
   goals met: 2 of 5
11. (push shakey box-2 inspection-room holding-room door-4)
   deleted: (isinside shakey inspection-room) (isinside box-2 inspection-room)
   added: (isinside shakey holding-room) (isinside box-2 holding-room)
   goals met: 3 of 5
12. (release shakey ball-1 holding-room gripper-1)
   deleted: (iscarrying ball-1 gripper-1)
   added: (isfree gripper-1) (isinside ball-1 holding-room)
   goals met: 4 of 5
13. (travel shakey holding-room inspection-room door-4)
   deleted: (isinside shakey holding-room)
   added: (isinside shakey inspection-room)
   goals met: 4 of 5
14. (travel shakey inspection-room cargo-room door-3)
   deleted: (isinside shakey inspection-room)
   added: (isinside shakey cargo-room)
   goals met: 5 of 5
